cf_billing/AccumulationRegisters/энргОбъемНачисленийПомещенийСРазделеннымиЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргОбъемНачисленийПомещенийСРазделеннымиЛС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиСоцНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленныйСоцНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависимаяТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСоциальнойНормы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеТарифаСверхНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЖильцов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПерерасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПерерасчетаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключатьВНеполивнойСезон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьМОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьСобственнаяПоставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовыщающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриборЗависимой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПоФормуле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СниматьНачисленныйСредний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьИзНормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьСреднийПоВсемТочкамУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСписаниеНачислений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонДифференцированногоТарифа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДиапазоныДифференцированныхТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СверхНорматива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргОбъемНачисленийПомещенийСРазделеннымиЛС/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей(ЭтотОбъект,Отказ,Замещение);
	РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.УдалитьНеЗначащиеЗаписи(ЭтотОбъект);
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
	
	ДобавитьОтложенныеДвижения(Регистратор);
	
	Если ЭтотОбъект.Количество() > 0 Тогда		
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли;
	
	энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	Если НЕ ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если НЕ ДополнительныеСвойства.Свойство("Организация") Тогда
		Если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Организация") Тогда
			ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
		Иначе
			ДополнительныеСвойства.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Строение") Тогда
		Если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"МКД") Тогда
			ДополнительныеСвойства.Вставить("Строение", Регистратор.МКД);
		Иначе
			ДополнительныеСвойства.Вставить("Строение", Справочники.энргСтроения.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Помещение") Тогда		
		ДополнительныеСвойства.Вставить("Помещение", Неопределено);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ЧастныйСектор") Тогда
		ДополнительныеСвойства.Вставить("ЧастныйСектор", Ложь);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Район") Тогда
		Если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Район") Тогда
			ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
		Иначе
			ДополнительныеСвойства.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
			
	НаборыЗаписей  						= Новый Структура;
	
	//РазделыЗаписи 						= Новый Массив;
	//
	//Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачисление") Тогда
	//	 РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.РаспределениеПомещения, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));
	//КонецЕсли;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачисление") Тогда
		
		НаборНачисленныйСреднийОбъем		= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
		НаборНачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
		НаборНачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
		НаборыЗаписей.Вставить("энргНачисленныйСреднийОбъем", 		НаборНачисленныйСреднийОбъем);
	КонецЕсли;
	
	//ДополнительныеСвойства.Вставить("РазделыЗаписи", РазделыЗаписи);	  
	
	//Если РазделыЗаписи.Количество() > 0 Тогда
	//	НаборОтложенныеДвижения 			= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	//	НаборОтложенныеДвижения.Отбор.ДокРегистратор.Установить(Регистратор);		
	//	НаборыЗаписей.Вставить("энргОтложенныеДвиженияДокументов", 		НаборОтложенныеДвижения);
	//КонецЕсли;
			
	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);
	
КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	перем НаборВзаиморасчеты, НачисленныйСредний;
	
	НаборыЗаписей 											= ДополнительныеСвойства.НаборыЗаписей;
	
	ЕстьНачисленныйСредний 									= Ложь; 
	
	Если НаборыЗаписей.Свойство("энргНачисленныйСреднийОбъем", НачисленныйСредний) Тогда
		ЕстьНачисленныйСредний 								= Истина;
	КонецЕсли;   	
	
	Если ЕстьНачисленныйСредний тогда
		НачисленныйСреднийПрочитан 							= Ложь;
		Если ДополнительныеСвойства.Свойство("НачисленныйСреднийПрочитан") Тогда
			НачисленныйСреднийПрочитан						= ДополнительныеСвойства.НачисленныйСреднийПрочитан;
		КонецЕсли; 		
		Если НЕ НачисленныйСреднийПрочитан Тогда			
			РезультатНачисленныйСредний 					= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.РезультатНачисленныйСреднийОбъем(ДополнительныеСвойства.ОтложенныеНачисленияПоПриборам.Выгрузить()); ;
			ВыборкаНачисленныйСредний 						= РезультатНачисленныйСредний.Выбрать();
			Пока ВыборкаНачисленныйСредний.Следующий() Цикл
				Запись										= НачисленныйСредний.ДобавитьПриход();
				ЗаполнитьЗначенияСвойств(Запись,ВыборкаНачисленныйСредний);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДобавитьОтложенныеДвижения(Регистратор)
	перем НаборОтложенныеДвижения;
	
	НаборыЗаписей 						= ДополнительныеСвойства.НаборыЗаписей;
	
	Если Не НаборыЗаписей.Свойство("энргОтложенныеДвиженияДокументов", НаборОтложенныеДвижения) Тогда
		Возврат;
	КонецЕсли;
		
	РазделыЗаписи 						= ДополнительныеСвойства.РазделыЗаписи;
		
	Для Каждого СтрокаРаздела Из РазделыЗаписи Цикл	    
		Если ЭтотОбъект.Количество() > 0 Тогда					
			НоваяЗапись 					= НаборОтложенныеДвижения.Добавить();
			НоваяЗапись.Организация		 	= ДополнительныеСвойства.Организация;
			НоваяЗапись.ПериодНачисления 	= СтрокаРаздела.ПериодНачисления;
			НоваяЗапись.Район 				= ДополнительныеСвойства.Район;
			НоваяЗапись.РазделЗаписи 		= СтрокаРаздела.Раздел;
			НоваяЗапись.ДокРегистратор 		= Регистратор;
			НоваяЗапись.ДатаРегистратора 	= ДополнительныеСвойства.ДатаРегистратора;
			НоваяЗапись.Строение 			= ДополнительныеСвойства.Строение;
			НоваяЗапись.ЧастныйСектор		= ДополнительныеСвойства.ЧастныйСектор;
		КонецЕсли; 				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
